app/views/moods/show.html.erb

		<ul>
			<% @mood.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" INNER JOIN "taggings" ON "songs"."id" = "taggings"."song_id" WHERE "taggings"."mood_id" = ?  [["mood_id", 4]]