app/views/songs/index.html.erb

					<td>
						<% song.moods.each do |mood| %>
---
SELECT "moods".* FROM "moods" INNER JOIN "taggings" ON "moods"."id" = "taggings"."mood_id" WHERE "taggings"."song_id" = ?  [["song_id", 26]]