app/views/songs/play.html.erb

SELECT "moods".* FROM "moods" INNER JOIN "taggings" ON "moods"."id" = "taggings"."mood_id" WHERE "taggings"."song_id" = ?  [["song_id", 26]]
---
						<td>
							<% song.moods.each do |mood| %>