app/controllers/moods_controller.rb

	def show
		@mood=Mood.find(params[:id])
---
SELECT  "moods".* FROM "moods" WHERE "moods"."id" = ? LIMIT 1  [["id", 4]]

	def index
		@moods=Mood.all
---
SELECT "moods".* FROM "moods"