app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."user_id" = ?  ORDER BY LOWER(song_title)  [["user_id", 2]]
---
	def index
		@u=current_user
		@songs=@u.songs.order("LOWER(song_title)")

SELECT "songs".* FROM "songs" WHERE (song_title like '%vari%')  ORDER BY LOWER(song_title)
SELECT "songs".* FROM "songs"  ORDER BY "songs"."song_title" ASC
---
	def play
		if params[:q].present?
			@songs=Song.where("song_title like ?", "%#{params[:q]}%").order("LOWER(song_title)")
		else
			@songs=Song.all.order("LOWER(song_title)")

INSERT INTO "songs" ("song_title", "song_url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["song_title", "SampleAudio_0.4mb (2).mp3"], ["song_url", "SampleAudio_0.4mb__2_.mp3"], ["user_id", 2], ["created_at", "2017-07-20 10:01:36.842047"], ["updated_at", "2017-07-20 10:01:36.842047"]]
---
	def create
		@song = current_user.songs.new(song_params)
		@song.song_title = params[:song][:song_url].original_filename if params[:song][:song_url].present?
		if @song.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 5]]
---
	def download
		@song = Song.find(params[:id])